// Коммунист Эмиль стал главой товарищества дома по улице Ленина, 17, в котором находятся N квартир. 
// Желая устранить несправедливость и зная стоимость квартир, Эмиль решил, что посчитает количество тех угнетателей пролетариата, 
// чья квартира дороже квартир соседей. Помогите ему в этом нелёгком труде.
// Соседями считаются квартиры, расположенные слева и справа от заданной квартиры (при наличии). 
// В первой строке вводится число N - количество квартир. Во второй строке записаны N чисел.

// Формат ввода
// 5
// 1 2 3 4 5

// Формат вывода
// 1