// Аркадий доигрался и уронил стопку с личными делами на каждого из своих друзей. Помогите собрать все необходимые документы в правильном порядке!

// Стопка документов упала листами следующим образом: сначала располагается Фамилия, потом Имя, потом Класс и Дата рождения.

// Составьте отсортированный список по названию класса, а внутри класса по фамилиям из его друзей.

// Формат ввода
// 3
// Sidorov
// Sidor
// 9A
// 20.07.93
// Petrov
// Petr
// 9B
// 23.10.92
// Ivanov
// Ivan
// 9A
// 10.04.93

// Формат вывода
// 9A Ivanov Ivan 10.04.93
// 9A Sidorov Sidor 20.07.93
// 9B Petrov Petr 23.10.92