// Кирилл очень любит грибы. У него есть друг Александр, 
// который периодически присылает ему координаты грибов (ячейки сетки на карте по вертикали и горизонтали), но есть проблема: У Кирилла 2 по географии.
// Необходимо помочь Кириллу и составить таблицу по точкам, в которой местоположение грибов обозначается *, 
// а остальные ячейки содержат количество грибов вокруг данной точки (как в сапёре).
// ВСЕ СИМВОЛЫ ВЫВОДЯТСЯ БЕЗ ПРОБЕЛОВ

// Формат ввода
// 3 2
// 2
// 1 1
// 2 2

// Формат вывода
// * 2
// 2 *
// 1 1