// Группа студентов, состоящая из N человек решает, после какой пары они хотели бы пойти в КФС. 
// Если студенты, желающие уйти с одной и той же пары, стоят рядом, то они уходят, а остальные продвигаются друг к другу.
// Например, 1 2 3 3 2 1 сначала превратится в последовательность 1 2 2 1, потом в 1 1, а потом не останется никого.
// Спрашивается: сколько студентов всего найдут себе компанию и дойдут до КФС?
// Например, для приведённой последовательности ответом будет число 6.

// Формат ввода
// 6 1 2 3 3 2 1

// Формат вывода
// 6