// Инфлюэнсер Аркадий - очень странный вандал. Аркадий выбирает число N (от 1 до 100), выбирает стену, в которой можно выделить квадрат из кирпичей NxN и
// заполняет его по следующему правилу: 
// 1. Все кирпичи выше побочной диагонали квадрата (из правого угла в левый) заполняет цифрой 0. 
// 2. Все кирпичи на побочной диагонали заполняет цифрой 1. 
// 3. Все кирпичи ниже побочной заполняет цифрой 2.
// Необходимо спрогнозировать результат его работы в зависимости от N.

// Формат ввода
// 4

// Формат вывода
// 0 0 0 1
// 0 0 1 2
// 0 1 2 2
// 1 2 2 2