// Фрилансер Татьяна устала от разгадывания капчи в интернете, поэтому пошла на завод по получению натуральных чисел. 
// За станком Татьяны есть только 2 кнопки: "-1" и ":2". 
// На экране у Татьяны появляются два числа А и В (А>B). Татьяна может разделить число на 2, если оно чётное, либо вычесть 1 в противном случае.
// Необходимо вывести последовательность нажатий кнопок КАЖДЫЙ В ОТДЕЛЬНОЙ СТРОКЕ Татьяной, которая преобразует число А в число В за минимальное количество нажатий.

// Формат ввода
// 179
// 20

// Формат вывода
// -1
// :2
// -1
// :2
// :2
// -1
// -1