// Алексею надоело читать пользовательские соглашения, поэтому он решил собрать все текстовые файлы с ними и попортить каждое
// из них следующим образом: он берёт текстовый файл и удаляет из него буквы, которые содержаться во фразе "user agreement", 
// то есть буквы "u", "s", "e" и т.д. вне зависимости от их регистра.

// Необходимо помочь автоматизировать Лёше этот процесс. На вход программа получает файл input.txt, в файл output.txt выводит
//  текст из файла input.txt без соответствующих букв.

// Формат ввода
// useragreement45kkl

// Формат вывода
// 45kkl