// Айрат впервые приехал в Москву и решил пойти поесть в Сабвэй. Заказал себе к сабу дня все возможные добавки (всего N ингредиентов), получил заказ, но понял следующее: 1. У него всего 3 салфетки на него одного. 2. Ему необходимо перебрать каждый ингредиент, чтобы проверить, можно ему его есть или нет. 3. Он хочет собрать свой саб заново на любой салфетке (так сложилось). Все ингредиенты расположены строго по убыванию размера снизу вверх. Большой ингредиент на маленький класть нельзя, чтобы бутерброд не развалился. Требуется написать программу, которая поможет Айрату переложить все ингредиенты по одному на ТРЕТЬЮ салфетку. Число N подаётся в текстовый файл input.txt, результат записывается в output.txt

// Формат ввода
// 2

// Формат вывода
// Ingredient 1 move from 1 to 2
// Ingredient 2 move from 1 to 3
// Ingredient 1 move from 2 to 3