// Один пожилой учитель математики написал на доске последовательность, в которой первый элемент равен 1, а последующие построены по определённому правилу:
// 1
// 11
// 21
// 1211
// 111221
// 312211
// 13112221
// ...
// Необходимо написать программу, которая на вход получает число Х (первый член последовательности) и число N (количество элементов), 
// а выводит N-ую строку соответствующем заданному числу последовательности, 
// пока учитель ищет глицин и пытается вспомнить правило построения данной последовательности.

// Формат ввода
// 1 4

// Формат вывода
// 1211