// Преподавателю по программированию стало нечем занять своих студентов, поэтому он придумал, 
// что хочет получить обработчик текстовых файлов, который работает по следующему алгоритму: 
// программа считывает из текстового файла input.txt строку, состоящую не более, чем из 255 символов. 
// Программа записывает в выходной файл output.txt указанную последовательность символов, 
// кроме случаев, если в данной строке встречаются числа (последовательность цифр = 1 число). 
// Тогда программа преобразует эти числа в двоичную систему счисления.

// Формат ввода
// 6^&678JKjdkdl;?.,lk879Pk1kdfl4839

// Формат вывода
// 110^&1010100110JKjdkdl;?.,lk1101101111Pk1kdfl1001011100111