// Числа Фибоначчи образуют последовательность чисел, определяемую следующим правилом: Первое число последовательности равно 0. Второе число последовательности равно 1. Каждое последующее число равно сумме двух предыдущих. Таким образом, образуется последовательность: 0, 1, 1, 2, 3, 5 и т.д. Его сосед* Бибоначчи тоже захотел прославится и придумал свою последовательность, в которой первое число равно A, второе число равно B. Каждое последующее число равно произведению двух предыдущих. Пользователь вводит через пробел числа A, B и С, где C - номер элемента последовательности. Вывести число Бибоначчи под номером С.

// заявленное в задаче не является историческим фактом, а придумано конкретно для заданного условия.
// Формат ввода
// 2 3 4

// Формат вывода
// 18